<?php
/**
 +------------------------------------------------------------------------------
 * Field 自定义字段类
 +------------------------------------------------------------------------------
 * @category   hhh
 
 * @author    hhh  
 * @version   $Id: Field.php  2015-04-15   $
 +------------------------------------------------------------------------------
 */
class Ceils{
	 
    //protected $column           = 0; //列号
	//protected $line           = 0 ; //行号
	protected $parent         = null;//父lei
	protected $children       = null; //子类
	protected $name          = null;//
	protected $value          = null;//
	protected $h                  =0;//最下层长度
	protected $thish                  =0;//所在数组层长度
	protected $parentField             =null;//父字段
	protected $parentKey         = null;//父ID
	//protected $dimensio        = null;
	 
	 
	/**
     +----------------------------------------------------------
     * 架构函数 取得模板对象实例
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     */
    public function __construct() {
        
    }
	 
	 /**
     +----------------------------------------------------------
     * 自动变量设置
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @param $name 属性名称
     * @param $value  属性值
     +----------------------------------------------------------
     */
    public function __set($name ,$value) {
        if(property_exists($this,$name))
            $this->$name = $value;
    }

    /**
     +----------------------------------------------------------
     * 自动变量获取
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @param $name 属性名称
     +----------------------------------------------------------
     * @return mixed
     +----------------------------------------------------------
     */
    public function __get($name) {
        return isset($this->$name)?$this->$name:null;
    }
	 
}