<?php
$config = array(
    /*'DB_TYPE'=>'mysql',
    'DB_HOST'=>'127.0.0.1',
    'DB_NAME'=>'365tf',
    'DB_USER'=>'root',
    'DB_PWD'=>'',
    'DB_PORT'=>'3306',
    'DB_PREFIX'=>'',
    'DB_CHARSET'=>'gbk',*/
    'DB_TYPE' => 'oracle', // 数据库类型
    //'DB_HOST' => '192.168.105.94', // 服务器地址
    'DB_NAME' => 'lorcl', // 数据库名
    'DB_USER' => 'oms', // 用户名
    'DB_PWD' => 'oms', // 密码
    'DB_PORT' => '1521', // 端口
    'DB_CHARSET'=>  'gbk',      // 数据库编码
    'DB_PREFIX' => '', // 数据库表前缀
    //'DB_CASE_LOWER'=>false,

    'DEFAULT_CHARSET' => 'gb2312', // 默认输出编码
    'URL_CASE_INSENSITIVE'  => false,   // 默认false 表示URL区分大小写 true则表示不区分大小写
    'URL_MODEL'             => 3,       // URL访问模式,可选参数0、1、2、3,代表以下四种模式：
    // 0 (普通模式); 1 (PATHINFO 模式); 2 (REWRITE  模式); 3 (兼容模式)  默认为PATHINFO 模式，提供最好的用户体验和SEO支持
    'URL_PATHINFO_DEPR'     => '/',	// PATHINFO模式下，各参数之间的分割符号
    'URL_HTML_SUFFIX'       => '',  // URL伪静态后缀设置
    'VAR_URL_PARAMS'      => '_URL_', // PATHINFO URL参数变量

    'TMPL_CACHE_ON' => false,
    'PAGESIZE'=>20,
    'DEFAULTPWD'=>'House365**',//默认密码
    //数据库类型
    'DBTYPE' =>array(

        '1'=>'ORACLE',
        '2'=>'MYSQL'

    ),

    //'SHOW_PAGE_TRACE'=>true,    //开启调试页面
    //'LOAD_EXT_CONFIG'=>$_COOKIE[CITYEN].'Config',//这个只能动态加载否则出错
    /****************数据库连接*****************/
    /*memcache 设置*/
    /*************部门************/
    'department_aray'=>array(
        '1'=>"技术部",
        '2'=>"新房组",
        '3'=>"二手房组",
        '4'=>"家居组",
        '5'=>"生活组",
        '6'=>"客服组"
    ),
    /*************条口************/
    'power_come_from'=>array(
        '1'=>"新房",
        '2'=>"二手房",
        '3'=>"家居",
        '4'=>"生活"
    ),
    /*************城市************/
    'city_array'=>array(
        "1000000"   =>"南京",
        "3000000"   =>"苏州",
        "7000000"   =>"芜湖",
        "8000000"   =>"合肥",
        "9000000"   =>"无锡",
        "10000000"  =>"杭州",
        "11000000"  =>"常州",
        "15000000"  =>"昆山",
        "17000000"  =>"西安",
        "18000000"  =>"重庆",
        "19000000"  =>"沈阳",
        "52000000"  =>"天津",
        "49000000"  => "南通",
        "128000000" => "嘉兴",
        "55000000"  => "扬州",
        "51000000"  => "泰州",
        "234000000" => "淮北",
        "42000000"  => "蚌埠",
        "235000000" => "成都",
        "50000000"  => "徐州",
        "57000000"  => "宜兴",
        "188000000" => "武汉",
        "99000000"  => "哈尔滨",
        "175000000" => "石家庄",
        "43000000"  => "滁州",
        '237000000' => '长春',
        '231000000' => '宿州',
        '415000000' => '涪陵',
        '238000000' => '潮州',
        '112000000' => '衡水',
        '239000000' => '揭阳',
        '172000000' => '汕头',
        '48000000'  => '马鞍山',
        '131000000' => '临沂',
        '229000000' => '株洲',
        '84000000'  => '德州',
        '126000000' => '济宁',
        '64000000'  => '保定',
        '146000000' => '宁波',
        '220000000' => '中山',
        '221000000' => '珠海',
        '82000000'  => '大连',
        '233000000' => '阜阳',
        '78000000'  => '金华',
        '79000000'  => '邯郸',
        '80000000'  => '遵义',
        '421000000' => '句容',
        '91000000'  => '佛山',
        '98000000'  => '广州',
        '110000000' => '郑州',
        '114000000' => '惠州',
        '139000000' => '洛阳',
        '147000000' => '南昌',
        '178000000' => '深圳',
        '185000000' => '太原',
        '423000000' => '六合',
        '425000000' => '贵阳',
        '427000000' => '南宁',
        '82000000'  => '兰州',
        '85000000'  => '培训',
        '86000000'  => '泉州',
        '87000000'  => '昆明',
        '88000000'  => '恩施',
    ),
    'city_config_array'=>array(
        "1000000"   =>"nj",
        "3000000"   =>"sz",
        "7000000"   =>"wh",
        "8000000"   =>"hf",
        "9000000"   =>"wx",
        "10000000"  =>"hz",
        "11000000"  =>"cz",
        "15000000"  =>"ks",
        "17000000"  =>"xa",
        "18000000"  =>"cq",
        "19000000"  =>"sy",
        "52000000"  =>"tj",
        "49000000"  => "nt",
        "128000000" => "jx",
        "55000000"  => "yz",
        "51000000"  => "tz",
        "234000000" => "hb",
        "42000000"  => "bb",
        "235000000" => "cd",
        "50000000"  => "xz",
        "57000000"  => "yx",
        "188000000" => "wuhan",
        "99000000"  => "hrb",
        "175000000" => "sjz",
        "43000000"  => "chuzhou",
        '237000000' => 'cc',
        '231000000' => 'suzhou',
        '415000000' => 'fuling',
        '238000000' => 'chaozhou',
        '112000000' => 'hs',
        '239000000' => 'jieyan',
        '172000000' => 'st',
        '48000000'  => 'mas',
        '131000000' => 'ly',
        '229000000' => 'zhuzhou',
        '84000000'  => 'dz',
        '126000000' => 'jining',
        '64000000'  => 'bd',
        '146000000' => 'nb',
        '220000000' => 'zs',
        '221000000' => 'zh',
        '82000000'  => 'dl',
        '233000000' => 'fy',
        '78000000'  => 'jh',
        '79000000'  => 'hd',
        '80000000'  => 'zunyi',
        '421000000' => 'jr',
        '91000000'  => 'fs',
        '98000000'  => 'gz',
        '110000000' => 'zz',
        '114000000' => 'huizhou',
        '139000000' => 'luoyang',
        '147000000' => 'nc',
        '178000000' => 'shenzhen',
        '185000000' => 'ty',
        '423000000' => 'lh',
        '425000000' => 'gy',
        '427000000' => 'nn',
        '82000000'  => 'lz',
        '85000000'  => 'peixun',
        '86000000'  => 'qz',
        '87000000'  => 'km',
        '88000000'  => 'enshi',
    ),
    /*************城市************/


    /*************城市************/
    'NONEPOWER'=>array(
        'Index/login',//登陆模块
        'Index/verify',//验证码模块
        'Index/loginOut',//退出模块
        'Mall/api_check',//电商登录验证模块
    ),
    'NONEROLE'=>array(
        'Index/index',//默认页
        'Index/top',//顶部页面
        'Index/left',//左边页面
        'Index/welcome',//默认页面
        'Refer/getchannel',//默认页面
        'Client/checkid',//默认页
        'Upfile/ueditorUpImage',
        'Project/ajax_get_project_list',//获取项目信息
        'Project/ajax_get_feescale',//获取费用信息
        'Project/ajax_get_houseinfo_by_pid',//获取项目楼盘信息
        'Member/show_pay_list',
        'Member/show_refund_list',
        'Member/show_bill_list',
        'Member/apply_invoice',
        'Member/export_member',
        'Business/opinionFlow',
        'Business/cost_list',
        'Business/fund_pool_status',
        'Member/get_minfo_by_telno',
        'Member/merchant_manage',
        'MemberRefund/refund_list',
        'MemberRefund/add_to_audit_list',
        'MemberRefund/refund_audit_list',
        'MemberRefund/opinionFlow',
        'MemberRefund/delete_from_audit_list',
        'MemberRefund/delete_from_details',
        'MemberRefund/refund_progress_list'
    ),

    //贷款产品审核状态
    'SORT_STATUS' =>array(
        '0'=>'未提交审核',
        '1'=>'等待审核',
        '2'=>'审核已通过',
        '3'=>'审核未通过'
    ),

    //贷款申请状态
    'LOAN_STATUS' =>array(
        '0'=>'接受资料，等待联系',
        '1'=>'资料通过，等待签约',
        '2'=>'签约成功，等待放款',
        '3'=>'放款成功',
        '4'=>'放款失败'
    ),
    'DB_TRIGGER_PREFIX'	=>	'TIG_',
    'DB_SEQUENCE_PREFIX' =>	'SEQ_',

    'filterType' => array('1'=>'模糊','2'=>'为空','3'=>'=','4'=>'非空','5'=>'>=','6'=>'<=','7'=>'>','8'=>'<','9'=>'in'),

);

return $config;
?>